Revit 2024 API
BuiltInFailures.JoinElementsFailures.FootingWillMoveToBottom Property
 An attached Structural Foundation will be moved to the bottom of the Column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FootingWillMoveToBottom { get; }
Visual Basic
Public Shared ReadOnly Property FootingWillMoveToBottom As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FootingWillMoveToBottom {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace